class Menu:
    @staticmethod
    def show():
        print("\n1. Прямой / обратный / дополнительный код")
        print("2. Сложение в дополнительном коде")
        print("3. Вычитание в дополнительном коде")
        print("4. Умножение в прямом коде")
        print("5. Деление в прямом коде")
        print("6. IEEE-754: сложение")
        print("7. IEEE-754: вычитание")
        print("8. IEEE-754: умножение")
        print("9. IEEE-754: деление")
        print("10. Excess-3 BCD: сложение") # Изменили под тебя
        print("0. Выход")